{
  "meta": {
    "title": "Diogo Pereira - Desenvolvedor Fullstack",
    "description": "Apaixonado por construir sistemas robustos, seguros e escaláveis. Experiência em front-end, back-end, mobile, desktop e DevOps.",
    "keywords": "Diogo Pereira, Fullstack Developer, Desenvolvedor Fullstack, Web Development, Desenvolvimento Web, Frontend, Backend, JavaScript, TypeScript, React, Node.js, HTML, CSS, Desenvolvimento Mobile, Mobile Development, Desenvolvimento Desktop, Desktop Development, DevOps, API, Software Engineer, Engenheiro de Software, Programmer, Programador, Developer Portfolio, Portfólio Desenvolvedor"
  },
  "nav": {
    "home": "Início",
    "about": "Sobre",
    "skills": "Habilidades",
    "projects": "Projetos",
    "contact": "Contato",
    "hireMe": "Contrate-me"
  },
  "header": {
    "greeting": "OLÁ, EU SOU",
    "description": "Eu crio produtos digitais resilientes, performáticos e seguros. Unindo um design atraente do frontend, a robustez do backend e a automação do DevOps.",
    "actions": {
      "viewProjects": "Ver Projetos",
      "letsTalk": "Vamos Conversar",
      "openGithub": "Veja meu GitHub"
    },
    "highlight": {
      "label": "ATUALMENTE",
      "value": "Criando Experiências impactantes",
      "sub": "Focado em código de alta qualidade e DX",
      "points": [
        "Melhorando performance e acessibilidade",
        "Desenhando arquiteturas escaláveis",
        "Prototipando experiências de alta qualidade"
      ],
      "stats": {
        "years": "Anos",
        "projects": "Projetos"
      }
    }
  },
  "about": {
    "greeting": "SOBRE",
    "title": "Quem Sou Eu",
    "description": "Eu sou um desenvolvedor de software sempre buscando excelência em meus trabalhos e projetos pessoais.",
    "paragraphs": [
      "Com uma paixão por tecnologia desde jovem, comecei minha jornada no desenvolvimento de software há vários anos. Ao longo do tempo, adquiri experiência em diversas áreas, incluindo front-end, back-end, mobile, desktop e DevOps.",
      "Estou sempre em busca de novos desafios e oportunidades para aprender e crescer como profissional. Se você está procurando um desenvolvedor dedicado e apaixonado para fazer parte do seu próximo projeto, adoraria conversar!"
    ],
    "insights": [
      { "title": "Experiência", "desc": "Experiência em diversas áreas como dev de software.", "icon": "material-symbols:auto-awesome-rounded" },
      { "title": "Aprendizado", "desc": "Adaptação eficiente a novas tecnologias e metodologias.", "icon": "material-symbols:lightbulb-rounded" },
      { "title": "Autonomia", "desc": "Capacidade de trabalhar de forma independente e tomar decisões.", "icon": "material-symbols:explore-rounded" },
      { "title": "Eficiência", "desc": "Otimização de processos e foco em resultados.", "icon": "material-symbols:equalizer-rounded" }
    ],
    "timeline": [
      {
        "period": "2020 - 2022",
        "role": "Desenvolvedor Mid-Level",
        "description": "Atuei como desenvolvedor Mid-Level Fullstack e DevOps, em projetos freelance voltados ao meio de e-commerce."
      },
      {
        "period": "2023 - 2025",
        "role": "Desenvolvedor Sênior",
        "description": "Atuei como desenvolvedor sênior em uma empresa do campo de vendas digitais, liderando o desenvolvimento completo dos projetos."
      },
      {
        "period": "2025 - Atual",
        "role": "Desenvolvedor Mid-Level",
        "description": "Atualmente, atuo como Fullstack e DevOps, como Mid-Level pois vi uma oportunidade de crescimento profissional."
      }
    ]
  },
  "projects": {
    "greeting": "PROJETOS",
    "title": "Meu Trabalho",
    "description": "Aqui estão alguns dos projetos em que trabalhei recentemente.",
    "searchbar": {
      "placeholder": "Pesquisar por nome ou tecnologia..."
    },
    "list": {
      "httpzen": {
        "title": "HTTPZen",
        "description": "Um cliente HTTP moderno e bonito para o terminal, inspirado no HTTPie e CURL."
      },
      "pulsar": {
        "title": "Pulsar",
        "description": "Crie documentações bonitas e personalizáveis para seus projetos em segundos."
      },
      "devy": {
        "title": "Devy",
        "description": "Um aplicativo que ajudará você a se concentrar em seus estudos, fornecendo ferramentas sonoras, um temporizador, etc."
      },
      "pixarti": {
        "title": "Pixarti",
        "description": "Uma página para criar pixel arts e exportar para CSS puro."
      }
    },
    "viewLive": "Ver Online",
    "viewCode": "Código Fonte",
    "showMore": "Ver Mais",
    "noProjects": "Nenhum projeto encontrado na sua busca."
  },
  "skills": {
    "greeting": "HABILIDADES",
    "title": "Minha Especialização",
    "description": "Aqui estão algumas das habilidades e tecnologias em que sou especialista.",
    "searchbar": {
      "placeholder": "Pesquisar por nome ou tecnologia..."
    }
  }
}